app/controllers/products_controller.rb

  def index
    @products = Product.all
    @categories = Category.all
---
SELECT "products".* FROM "products"
SELECT "categories".* FROM "categories"

  def create
    @product = current_admin.posts.build(product_params)

    if @product.save
---
INSERT INTO "products" ("name", "description", "list_price", "quantity", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "My Product"], ["description", "Product description"], ["list_price", 5.0], ["quantity", 10], ["created_at", "2016-05-03 23:30:55.113358"], ["updated_at", "2016-05-03 23:30:55.113358"]]

  def update
    @product = Product.find(params[:id])

    if @product.update(product_params)
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "products" SET "name" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["name", "My Product"], ["updated_at", "2016-05-03 23:51:08.192375"], ["id", 1]]